Autodesk.Revit.DB.ProjectParameterAccess.MarkUploadedParameterIdentifiers(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeTypeId})
Records given ForgeTypeId's as identifiers of the local
parameters with the given ElementId's.
The local parameter's ForgeTypeId identifiers are not changed until the next
call to CommitUpdates() on this object.
After calling this method, GetForgeParametersInActiveModel() may return different results, reflecting that
local parameters have been updated with their new Forge parameter identifiers.
elementIds:
Local parameters.
paramTypeIds:
Schema identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null